# Merging and Joining

Merging and joining data from different sources is a critical skill enabling analysts to integrate and consolidate information from multiple datasets.

**Sample data**:

In [1]:
import pandas as pd

In [2]:
employees = {
    'employee_id': [2, 3, 4, 7],
    'name': ['Sal', 'Yang', 'Khaya', 'Lin'],
    'department': ['Sales', 'Marketing', 'Engineering', 'Sales'],
    'salary': [60000, 75000, 80000, 62000]
}

access_control = {
    'employee_id': [3, 7, 8, 9],
    'access_level': ['high', 'low', 'low', 'high']
}

df1 = pd.DataFrame(employees)
df2 = pd.DataFrame(access_control)

display(df1)
display(df2)

   employee_id   name   department  salary
0            2    Sal        Sales   60000
1            3   Yang    Marketing   75000
2            4  Khaya  Engineering   80000
3            7    Lin        Sales   62000

   employee_id access_level
0            3         high
1            7          low
2            8          low
3            9         high

## Inner Join

An inner join merges two datasets based on a common key, keeping only the rows that have matching keys in both datasets.

In [3]:
result = pd.merge(df1, df2, on='employee_id', how='inner')
result

   employee_id  name department  salary access_level
0            3  Yang  Marketing   75000         high
1            7   Lin      Sales   62000          low

## Left Join

A left join returns all the rows from the left dataset and the matched rows from the right dataset. Any unmatched rows in the right dataset will contain NaN values.

In [4]:
result = pd.merge(df1, df2, on='employee_id', how='left')
result

   employee_id   name   department  salary access_level
0            2    Sal        Sales   60000          NaN
1            3   Yang    Marketing   75000         high
2            4  Khaya  Engineering   80000          NaN
3            7    Lin        Sales   62000          low

## Concatenation

Concatenation is used to combine datasets along a particular axis, either row-wise or column-wise.

In [5]:
df1 = pd.DataFrame({'employee_id': [2, 3], 'name': ['Sal', 'Yang'], 'department': ['Sales', 'Marketing']})
df2 = pd.DataFrame({'employee_id': [4, 7], 'name': ['Khaya', 'Lin'], 'department': ['Engineering', 'Sales']})
result = pd.concat([df1, df2])
result

   employee_id   name   department
0            2    Sal        Sales
1            3   Yang    Marketing
0            4  Khaya  Engineering
1            7    Lin        Sales